<?xml version="1.0" ?>
<net name="model_ir" version="10">
	<layers>
		<layer id="0" name="dense_input" type="Parameter" version="opset1">
			<data element_type="f16" shape="1, 26"/>
			<output>
				<port id="0" names="Func/StatefulPartitionedCall/input/_0:0,dense_input:0" precision="FP16">
					<dim>1</dim>
					<dim>26</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="64, 26" size="3328"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp:0" precision="FP16">
					<dim>64</dim>
					<dim>26</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="StatefulPartitionedCall/sequential/dense/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>26</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>26</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/sequential/dense/MatMul:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f16" offset="3328" shape="1, 64" size="128"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="StatefulPartitionedCall/sequential/dense/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/sequential/dense/BiasAdd:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="StatefulPartitionedCall/sequential/dense/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/sequential/dense/Relu:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="StatefulPartitionedCall/sequential/dense_1/MatMul/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f16" offset="3456" shape="64, 64" size="8192"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/sequential/dense_1/MatMul/ReadVariableOp:0" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="StatefulPartitionedCall/sequential/dense_1/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/sequential/dense_1/MatMul:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="StatefulPartitionedCall/sequential/dense_1/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f16" offset="11648" shape="1, 64" size="128"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/sequential/dense_1/BiasAdd/ReadVariableOp:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="StatefulPartitionedCall/sequential/dense_1/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/sequential/dense_1/BiasAdd:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="StatefulPartitionedCall/sequential/dense_1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/sequential/dense_1/Relu:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="StatefulPartitionedCall/sequential/dense_2/MatMul/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f16" offset="11776" shape="8, 64" size="1024"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/sequential/dense_2/MatMul/ReadVariableOp:0" precision="FP16">
					<dim>8</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="StatefulPartitionedCall/sequential/dense_2/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>8</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/sequential/dense_2/MatMul:0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="StatefulPartitionedCall/sequential/dense_2/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f16" offset="12800" shape="1, 8" size="16"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/sequential/dense_2/BiasAdd/ReadVariableOp:0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="StatefulPartitionedCall/sequential/dense_2/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/sequential/dense_2/BiasAdd:0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="StatefulPartitionedCall/sequential/dense_2/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/sequential/dense_2/Relu:0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="StatefulPartitionedCall/sequential/dense_3/MatMul/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f16" offset="12816" shape="64, 8" size="1024"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/sequential/dense_3/MatMul/ReadVariableOp:0" precision="FP16">
					<dim>64</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="StatefulPartitionedCall/sequential/dense_3/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/sequential/dense_3/MatMul:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="StatefulPartitionedCall/sequential/dense_3/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f16" offset="13840" shape="1, 64" size="128"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/sequential/dense_3/BiasAdd/ReadVariableOp:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="StatefulPartitionedCall/sequential/dense_3/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/sequential/dense_3/BiasAdd:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="StatefulPartitionedCall/sequential/dense_3/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/sequential/dense_3/Relu:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="StatefulPartitionedCall/sequential/dense_4/MatMul/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f16" offset="13968" shape="64, 64" size="8192"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/sequential/dense_4/MatMul/ReadVariableOp:0" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="StatefulPartitionedCall/sequential/dense_4/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/sequential/dense_4/MatMul:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="StatefulPartitionedCall/sequential/dense_4/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f16" offset="22160" shape="1, 64" size="128"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/sequential/dense_4/BiasAdd/ReadVariableOp:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="StatefulPartitionedCall/sequential/dense_4/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/sequential/dense_4/BiasAdd:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="StatefulPartitionedCall/sequential/dense_4/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/sequential/dense_4/Relu:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="StatefulPartitionedCall/sequential/dense_5/MatMul/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f16" offset="22288" shape="26, 64" size="3328"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/sequential/dense_5/MatMul/ReadVariableOp:0" precision="FP16">
					<dim>26</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="StatefulPartitionedCall/sequential/dense_5/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>26</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/sequential/dense_5/MatMul:0" precision="FP16">
					<dim>1</dim>
					<dim>26</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="StatefulPartitionedCall/sequential/dense_5/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f16" offset="25616" shape="1, 26" size="52"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/sequential/dense_5/BiasAdd/ReadVariableOp:0" precision="FP16">
					<dim>1</dim>
					<dim>26</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="StatefulPartitionedCall/sequential/dense_5/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>26</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>26</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Func/StatefulPartitionedCall/output/_13:0,Identity:0,StatefulPartitionedCall/Identity:0,StatefulPartitionedCall/sequential/dense_5/BiasAdd:0" precision="FP16">
					<dim>1</dim>
					<dim>26</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Func/StatefulPartitionedCall/output/_13:0" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>26</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="2" to-port="0"/>
		<edge from-layer="1" from-port="0" to-layer="2" to-port="1"/>
		<edge from-layer="2" from-port="2" to-layer="4" to-port="0"/>
		<edge from-layer="3" from-port="0" to-layer="4" to-port="1"/>
		<edge from-layer="4" from-port="2" to-layer="5" to-port="0"/>
		<edge from-layer="5" from-port="1" to-layer="7" to-port="0"/>
		<edge from-layer="6" from-port="0" to-layer="7" to-port="1"/>
		<edge from-layer="7" from-port="2" to-layer="9" to-port="0"/>
		<edge from-layer="8" from-port="0" to-layer="9" to-port="1"/>
		<edge from-layer="9" from-port="2" to-layer="10" to-port="0"/>
		<edge from-layer="10" from-port="1" to-layer="12" to-port="0"/>
		<edge from-layer="11" from-port="0" to-layer="12" to-port="1"/>
		<edge from-layer="12" from-port="2" to-layer="14" to-port="0"/>
		<edge from-layer="13" from-port="0" to-layer="14" to-port="1"/>
		<edge from-layer="14" from-port="2" to-layer="15" to-port="0"/>
		<edge from-layer="15" from-port="1" to-layer="17" to-port="0"/>
		<edge from-layer="16" from-port="0" to-layer="17" to-port="1"/>
		<edge from-layer="17" from-port="2" to-layer="19" to-port="0"/>
		<edge from-layer="18" from-port="0" to-layer="19" to-port="1"/>
		<edge from-layer="19" from-port="2" to-layer="20" to-port="0"/>
		<edge from-layer="20" from-port="1" to-layer="22" to-port="0"/>
		<edge from-layer="21" from-port="0" to-layer="22" to-port="1"/>
		<edge from-layer="22" from-port="2" to-layer="24" to-port="0"/>
		<edge from-layer="23" from-port="0" to-layer="24" to-port="1"/>
		<edge from-layer="24" from-port="2" to-layer="25" to-port="0"/>
		<edge from-layer="25" from-port="1" to-layer="27" to-port="0"/>
		<edge from-layer="26" from-port="0" to-layer="27" to-port="1"/>
		<edge from-layer="27" from-port="2" to-layer="29" to-port="0"/>
		<edge from-layer="28" from-port="0" to-layer="29" to-port="1"/>
		<edge from-layer="29" from-port="2" to-layer="30" to-port="0"/>
	</edges>
	<meta_data>
		<MO_version value="2021.4.0-3839-cd81789d294-releases/2021/4"/>
		<cli_parameters>
			<data_type value="FP16"/>
			<disable_nhwc_to_nchw value="False"/>
			<disable_resnet_optimization value="False"/>
			<disable_weights_compression value="False"/>
			<enable_concat_optimization value="False"/>
			<extensions value="DIR"/>
			<framework value="tf"/>
			<freeze_placeholder_with_value value="{}"/>
			<generate_deprecated_IR_V7 value="False"/>
			<input_model_is_text value="False"/>
			<input_shape value="[1, 26]"/>
			<keep_shape_ops value="True"/>
			<legacy_ir_generation value="False"/>
			<log_level value="ERROR"/>
			<mean_scale_values value="{}"/>
			<mean_values value="()"/>
			<model_name value="model_ir"/>
			<output_dir value="DIR"/>
			<placeholder_data_types value="{}"/>
			<placeholder_shapes value="[ 1 26]"/>
			<progress value="False"/>
			<reverse_input_channels value="False"/>
			<saved_model_dir value="DIR"/>
			<scale_values value="()"/>
			<silent value="False"/>
			<static_shape value="False"/>
			<stream_output value="False"/>
			<transform value=""/>
			<unset unset_cli_parameters="batch, disable_fusing, disable_gfusing, finegrain_fusing, input, input_checkpoint, input_meta_graph, input_model, move_to_preprocess, output, saved_model_tags, scale, tensorboard_logdir, tensorflow_custom_layer_libraries, tensorflow_custom_operations_config_update, tensorflow_object_detection_api_pipeline_config, tensorflow_use_custom_operations_config, transformations_config"/>
		</cli_parameters>
	</meta_data>
</net>
